# 演習７～１３

[Google Colaboratoryで開く](https://colab.research.google.com/github/202408pythonciot/SQL/blob/main/Google_Colab/exercises_07_to_13.ipynb)

<a target="_blank" href="https://colab.research.google.com/github/202408pythonciot/SQL/blob/main/Google_Colab/exercises_07_to_13.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

**sqliteをロード**

In [ ]:
%reload_ext sql
%sql sqlite:///:memory:

**t_salesテーブル（車内販売表）**を作成

In [ ]:
%%sql
DROP TABLE IF EXISTS t_sales;
CREATE TABLE t_sales (
	sales_id		 INTEGER,
	staff_name	 TEXT NOT NULL,
	category		 TEXT NOT NULL,
	item		 TEXT NOT NULL,
	price		 INTEGER NOT NULL,
	PRIMARY KEY("sales_id")
);
INSERT INTO t_sales VALUES (1, '吉田 千代', 'アルコール', '日本酒', 600);
INSERT INTO t_sales VALUES (2, '吉田 千代', '軽食', 'ツナサンド', 200);
INSERT INTO t_sales VALUES (3, '吉田 千代', '軽食', 'おにぎりセット', 420);
INSERT INTO t_sales VALUES (4, '吉田 千代', 'スナック', 'チョコレート', 300);
INSERT INTO t_sales VALUES (5, '浜田 美香', 'アルコール', 'ビール', 200);
INSERT INTO t_sales VALUES (6, '浜田 美香', '軽食', 'ツナサンド', 200);
INSERT INTO t_sales VALUES (7, '斉藤 和夫', 'スナック', 'まんじゅう', 200);
INSERT INTO t_sales VALUES (8, '斉藤 和夫', 'アルコール', 'ビール', 200);
INSERT INTO t_sales VALUES (9, '吉田 千代', '軽食', 'おにぎりセット', 420);
INSERT INTO t_sales VALUES (10, '浜田 美香', '軽食', 'ツナサンド', 200);
INSERT INTO t_sales VALUES (11, '吉田 千代', 'アルコール', '日本酒', 600);
INSERT INTO t_sales VALUES (12, '吉田 千代', 'アルコール', '日本酒', 600);
INSERT INTO t_sales VALUES (13, '斉藤 和夫', '軽食', 'おにぎりセット', 420);
INSERT INTO t_sales VALUES (14, '吉田 千代', 'スナック', 'まんじゅう', 200);
INSERT INTO t_sales VALUES (15, '浜田 美香', 'スナック', 'チョコレート', 300);
INSERT INTO t_sales VALUES (16, '斉藤 和夫', '軽食', 'ツナサンド', 200);
INSERT INTO t_sales VALUES (17, '吉田 千代', 'スナック', 'まんじゅう', 200);
INSERT INTO t_sales VALUES (18, '浜田 美香', 'スナック', 'チョコレート', 300);
INSERT INTO t_sales VALUES (19, '浜田 美香', 'アルコール', 'ビール', 200);
INSERT INTO t_sales VALUES (20, '斉藤 和夫', 'スナック', 'チョコレート', 300);
INSERT INTO t_sales VALUES (21, '斉藤 和夫', 'スナック', 'まんじゅう', 200);
INSERT INTO t_sales VALUES (22, '吉田 千代', '軽食', 'ツナサンド', 200);
INSERT INTO t_sales VALUES (23, '斉藤 和夫', 'アルコール', '日本酒', 600);
INSERT INTO t_sales VALUES (24, '吉田 千代', '軽食', 'おにぎりセット', 420);
INSERT INTO t_sales VALUES (25, '斉藤 和夫', 'アルコール', 'ビール', 200);
INSERT INTO t_sales VALUES (26, '吉田 千代', 'スナック', 'まんじゅう', 200);
INSERT INTO t_sales VALUES (27, '斉藤 和夫', '軽食', 'おにぎりセット', 420);
INSERT INTO t_sales VALUES (28, '吉田 千代', 'アルコール', 'ビール', 200);
INSERT INTO t_sales VALUES (29, '浜田 美香', 'アルコール', 'ビール', 200);
INSERT INTO t_sales VALUES (30, '斉藤 和夫', '軽食', 'ツナサンド', 200);

**演習７**
t_sales表からpriceの合計を照会

In [ ]:
%%sql
SELECT SUM(price) FROM t_sales;

**演習８**
t_sales表からpriceの合計をitemごとに照会

In [ ]:
%%sql
SELECT item, SUM(price) FROM t_sales GROUP BY item;

**演習９**
t_sales表からstaff_nameごとの行数を照会

In [ ]:
%%sql
SELECT staff_name, COUNT(*) FROM t_sales GROUP BY staff_name;

**演習１０**
t_sales表からstaff_nameごとの行数とpriceの合計を照会

In [ ]:
%%sql
SELECT staff_name,COUNT(*), sum(price) FROM t_sales GROUP BY staff_name;

**演習１１**
t_sales表からstaff_nameごとの行数とpriceの合計を照会

In [ ]:
%%sql
SELECT category, COUNT(*),sum(price) FROM t_sales GROUP BY category;

**演習１２**
t_sales表からstaff_nameが'斉藤 和夫'である行を、itemごとにpriceの合計を照会

In [ ]:
%%sql
SELECT staff_name, item, sum(price) FROM t_sales WHERE staff_name = '斉藤 和夫' GROUP BY item;

**演習１３**
t_sales表から'おにぎりセット'の販売額の降順にstaff_nameを降順に照会

In [ ]:
%%sql
SELECT staff_name, item, SUM(price) FROM t_sales WHERE item = 'おにぎりセット' GROUP BY staff_name;